{
    "projects": [
        {
            "cover": "/portfolio/Black_Jack_proj.jpg",
            "title": "Building with Basics: Developing a simple Blackjack Game",
            "description": "My first project was a dynamic and interactive BlackJack game, built using HTML, CSS, and JavaScript. It was an exciting challenge for me to take on, and I was thrilled with the end result. The user interface was designed with a sleek and modern look, and the game mechanics were carefully crafted for a seamless experience. I was proud to have created my first project, and it was a great learning experience for me.",
            "URL": "http://timiscarrington.github.io/Project_1_BlackJack/",
            "Github_Frontend": "https://github.com/timiscarrington/Project_1_BlackJack"
        },
        {
            "cover": "/portfolio/airbnb.png",
            "title": "A Reverse-Engineered Approach to Building an Airbnb Clone",
            "description": "During a week-long bootcamp session, I collaborated with a group of talented individuals to develop a dynamic application. Our team utilized HTML5, CSS, Javascript, React, Bootstrap, MongoDB, Express, and Mongoose to bring the project to life. Despite the pressure of a tight deadline, we were able to successfully create a functional and visually appealing solution.",
            "URL": "https://jade-heliotrope-86f957.netlify.app/",
            "Github_Frontend": "https://github.com/timiscarrington/Abnb_airbnb_clone",
            "Github_Backend": "https://github.com/timiscarrington/Project-3-Backend"

        },
        {
            "cover": "/portfolio/gumstorehome.png",
            "title": "A-Listed Chew: E-Commerce Development with React and Redux",
            "description": "This project was completed in one week during my bootcamp, utilizing HTML5, CSS, Javascript, React, Bootstrap, MongoDB, Express, and Mongoose. It was a challenging and fast-paced experience, but I was able to deliver a functional and visually appealing application within the tight deadline.",
            "URL": "https://a-list-chew.netlify.app/",
            "Github_Frontend": "https://github.com/timiscarrington/Ecomm-Frontend",
            "Github_Backend" : "https://github.com/timiscarrington/gumstore_express_backend"
        },
        {
            "cover": "/portfolio/reddit.png",
            "title": "Building a Reddit Clone: A TypeScript and Firebase Project",
            "description": "By creating this Reddit clone, I gained a deeper understanding of TypeScript, Firebase, ChakraUI, and Next.js. I also got hands-on experience using Recoil for global state management. Through this project, I was able to improve my development skills and gain practical experience with these powerful tools. This project can be a great starting point for others who want to learn these technologies and build their own projects.",
            "URL": "https://clone-reddit-ochre.vercel.app/",
            "Github_Frontend": "https://github.com/timiscarrington/CloneReddit",
            "Github_Backend" : "https://github.com/timiscarrington/CloneReddit"
        }
    ]
}